
import { Difficulty } from './types';

export const TOPICS: string[] = [
  "소인수분해 (1학년 1학기)",
  "정수와 유리수 (1학년 1학기)",
  "문자의 사용과 식 (1학년 1학기)",
  "일차방정식 (1학년 1학기)",
  "좌표평면과 그래프 (1학년 1학기)",
  "기본도형 (1학년 2학기)",
  "작도와 합동 (1학년 2학기)",
  "평면도형의 성질 (1학년 2학기)",
  "입체도형의 성질 (1학년 2학기)",
  "대푯값 (1학년 2학기)",
  "도수분포표와 상대도수 (1학년 2학기)",
  "유리수와 순환소수 (2학년 1학기)",
  "식의 계산 (2학년 1학기)",
  "일차부등식 (2학년 1학기)",
  "연립일차방정식 (2학년 1학기)",
  "일차함수와 그 그래프 (2학년 1학기)",
  "일차함수와 일차방정식의 관계 (2학년 1학기)",
  "삼각형과 사각형의 성질 (2학년 2학기)",
  "도형의 닮음 (2학년 2학기)",
  "피타고라스 정리 (2학년 2학기)",
  "경우의 수와 확률 (2학년 2학기)",
  "제곱근과 실수 (3학년 1학기)",
  "다항식의 곱셈과 인수분해 (3학년 1학기)",
  "이차방정식 (3학년 1학기)",
  "이차함수와 그 그래프 (3학년 1학기)",
  "삼각비 (3학년 2학기)",
  "원의 성질 (3학년 2학기)",
  "산포도 (3학년 2학기)",
  "상자 그림과 산점도 (3학년 2학기)"
];

export const DIFFICULTIES: Difficulty[] = [
  Difficulty.Concept,
  Difficulty.Basic,
  Difficulty.Fundamental,
  Difficulty.Medium,
  Difficulty.Advanced,
  Difficulty.Intense,
  Difficulty.Top,
];